From 054a55524c3f521501df259962a82c1b9dfb83e5 Mon Sep 17 00:00:00 2001
From: Albert I <kras@raphielgang.org>
Date: Fri, 2 Apr 2021 13:01:04 +0800
Subject: [PATCH 1/2] abi-dumps/vndk: Update libbinder.so

Signed-off-by: Albert I <kras@raphielgang.org>
Change-Id: I70cc8ab5f42dfb92584365aa223d3b6c1f9a46ac
---
 .../source-based/libbinder.so.lsdump          | 150 +++++++++++++-----
 30/32/x86/source-based/libbinder.so.lsdump    | 150 +++++++++++++-----
 .../source-based/libbinder.so.lsdump          | 150 +++++++++++++-----
 .../source-based/libbinder.so.lsdump          | 150 +++++++++++++-----
 .../source-based/libbinder.so.lsdump          | 150 +++++++++++++-----
 30/64/x86/source-based/libbinder.so.lsdump    | 150 +++++++++++++-----
 30/64/x86_64/source-based/libbinder.so.lsdump | 150 +++++++++++++-----
 .../source-based/libbinder.so.lsdump          | 150 +++++++++++++-----
 8 files changed, 896 insertions(+), 304 deletions(-)

diff --git a/30/32/arm_armv7-a-neon/source-based/libbinder.so.lsdump b/30/32/arm_armv7-a-neon/source-based/libbinder.so.lsdump
index 2187c9f..75f2a64 100644
--- a/30/32/arm_armv7-a-neon/source-based/libbinder.so.lsdump
+++ b/30/32/arm_armv7-a-neon/source-based/libbinder.so.lsdump
@@ -1714,9 +1714,6 @@
   {
    "name" : "_ZN7android6binder6StatusC2EiiRKNS_7String8E"
   },
-  {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback11tryShutdownEv"
-  },
   {
    "name" : "_ZN7android6binder8internal21ClientCounterCallback12forcePersistEb"
   },

+     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
     },
     {
      "default_arg" : true,
@@ -21682,8 +21694,8 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> &",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
-   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/RefBase.h"
   },
@@ -22524,6 +22536,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> &",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIRN7android2spINS_7BBinderEEE",
@@ -23283,6 +23304,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7BBinderEEE",
@@ -23296,7 +23326,7 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> *",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "self_type" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
@@ -24444,6 +24474,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPN7android2spINS_7BBinderEEE",
@@ -24752,10 +24791,10 @@
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
-   "name" : "android::binder::internal::ClientCounterCallback *",
-   "referenced_type" : "_ZTIN7android6binder8internal21ClientCounterCallbackE",
-   "self_type" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
+   "linker_set_key" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
+   "name" : "android::binder::internal::ClientCounterCallbackImpl *",
+   "referenced_type" : "_ZTIN7android6binder8internal25ClientCounterCallbackImplE",
+   "self_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
@@ -26392,6 +26431,16 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "is_const" : true,
@@ -31666,62 +31715,68 @@
     },
     {
      "access" : "private",
-     "field_name" : "mMaxThreads",
+     "field_name" : "mWaitingForThreads",
      "field_offset" : 224,
      "referenced_type" : "_ZTIj"
     },
     {
      "access" : "private",
-     "field_name" : "mStarvationStartTimeMs",
+     "field_name" : "mMaxThreads",
      "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "access" : "private",
+     "field_name" : "mStarvationStartTimeMs",
+     "field_offset" : 320,
      "referenced_type" : "_ZTIx"
     },
     {
      "access" : "private",
      "field_name" : "mLock",
-     "field_offset" : 320,
+     "field_offset" : 384,
      "referenced_type" : "_ZTIN7android5MutexE"
     },
     {
      "access" : "private",
      "field_name" : "mHandleToObject",
-     "field_offset" : 352,
+     "field_offset" : 416,
      "referenced_type" : "_ZTIN7android6VectorINS_12ProcessState12handle_entryEEE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextCheckFunc",
-     "field_offset" : 512,
+     "field_offset" : 576,
      "referenced_type" : "_ZTIPFbRKN7android8String16ERKNS_2spINS_7IBinderEEEPvE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextUserData",
-     "field_offset" : 544,
+     "field_offset" : 608,
      "referenced_type" : "_ZTIPv"
     },
     {
      "access" : "private",
      "field_name" : "mRootDir",
-     "field_offset" : 576,
+     "field_offset" : 640,
      "referenced_type" : "_ZTIN7android7String8E"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolStarted",
-     "field_offset" : 608,
+     "field_offset" : 672,
      "referenced_type" : "_ZTIb"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolSeq",
-     "field_offset" : 640,
+     "field_offset" : 704,
      "referenced_type" : "_ZTIVi"
     },
     {
      "access" : "private",
      "field_name" : "mCallRestriction",
-     "field_offset" : 672,
+     "field_offset" : 736,
      "referenced_type" : "_ZTIN7android12ProcessState15CallRestrictionE"
     }
    ],
@@ -31730,12 +31785,12 @@
    "record_kind" : "class",
    "referenced_type" : "_ZTIN7android12ProcessStateE",
    "self_type" : "_ZTIN7android12ProcessStateE",
-   "size" : 96,
+   "size" : 104,
    "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
    "vtable_components" :
    [
     {
-     "component_value" : 88,
+     "component_value" : 96,
      "kind" : "vbase_offset"
     },
     {
@@ -31766,11 +31821,11 @@
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -96,
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -96,
      "kind" : "offset_to_top"
     },
     {
@@ -35305,6 +35360,25 @@
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
    "template_args" : [ "_ZTIN7android6ThreadE" ]
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "access" : "private",
+     "field_name" : "m_ptr",
+     "referenced_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE"
+    }
+   ],
+   "linker_set_key" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "record_kind" : "class",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
+   "template_args" : [ "_ZTIN7android6binder8internal25ClientCounterCallbackImplE" ]
+  },
   {
    "alignment" : 4,
    "fields" :
diff --git a/30/32/x86/source-based/libbinder.so.lsdump b/30/32/x86/source-based/libbinder.so.lsdump
index a53905e..714784f 100644
--- a/30/32/x86/source-based/libbinder.so.lsdump
+++ b/30/32/x86/source-based/libbinder.so.lsdump
@@ -1713,9 +1713,6 @@
   {
    "name" : "_ZN7android6binder6StatusC2EiiRKNS_7String8E"
   },
-  {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback11tryShutdownEv"
-  },
   {
    "name" : "_ZN7android6binder8internal21ClientCounterCallback12forcePersistEb"
   },
@@ -1723,7 +1720,22 @@
    "name" : "_ZN7android6binder8internal21ClientCounterCallback15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
   },
   {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback9onClientsERKNS_2spINS_7IBinderEEEb"
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC1Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC2Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl11tryShutdownEv"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl12forcePersistEb"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl9onClientsERKNS_2spINS_7IBinderEEEb"
   },
   {
    "name" : "_ZN7android6binderlsERNSt3__118basic_stringstreamIcNS1_11char_traitsIcEENS1_9allocatorIcEEEERKNS0_6StatusE"
@@ -3210,7 +3222,7 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
+   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
   },
   {
    "binding" : "weak",
@@ -3758,15 +3770,15 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
   },
   {
    "binding" : "weak",
@@ -4492,22 +4504,22 @@
    "name" : "_ZTCN7android2os17BpServiceCallbackE4_NS_9BpRefBaseE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_10IInterfaceE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_10IInterfaceE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os15IClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os15IClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os16BnClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os16BnClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7BBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7BBinderE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7IBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7IBinderE"
   },
   {
    "name" : "_ZTCN7android7BBinderE0_NS_7IBinderE"
@@ -4702,7 +4714,7 @@
    "name" : "_ZTTN7android2os17BpServiceCallbackE"
   },
   {
-   "name" : "_ZTTN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTTN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTTN7android7BBinderE"
@@ -4899,7 +4911,7 @@
    "name" : "_ZTVN7android6VectorIiEE"
   },
   {
-   "name" : "_ZTVN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTVN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTVN7android7BBinderE"
@@ -15154,7 +15166,7 @@
      "referenced_type" : "_ZTIPN7android8BpBinderE"
     },
     {
-     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
+     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
     },
     {
      "default_arg" : true,
@@ -21677,8 +21689,8 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> &",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
-   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/RefBase.h"
   },
@@ -22519,6 +22531,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> &",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIRN7android2spINS_7BBinderEEE",
@@ -23278,6 +23299,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7BBinderEEE",
@@ -23291,7 +23321,7 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> *",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "self_type" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
@@ -24439,6 +24469,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPN7android2spINS_7BBinderEEE",
@@ -24747,10 +24786,10 @@
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
-   "name" : "android::binder::internal::ClientCounterCallback *",
-   "referenced_type" : "_ZTIN7android6binder8internal21ClientCounterCallbackE",
-   "self_type" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
+   "linker_set_key" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
+   "name" : "android::binder::internal::ClientCounterCallbackImpl *",
+   "referenced_type" : "_ZTIN7android6binder8internal25ClientCounterCallbackImplE",
+   "self_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
@@ -26387,6 +26426,16 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "is_const" : true,
@@ -31661,62 +31710,68 @@
     },
     {
      "access" : "private",
-     "field_name" : "mMaxThreads",
+     "field_name" : "mWaitingForThreads",
      "field_offset" : 224,
      "referenced_type" : "_ZTIj"
     },
     {
      "access" : "private",
-     "field_name" : "mStarvationStartTimeMs",
+     "field_name" : "mMaxThreads",
      "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "access" : "private",
+     "field_name" : "mStarvationStartTimeMs",
+     "field_offset" : 288,
      "referenced_type" : "_ZTIx"
     },
     {
      "access" : "private",
      "field_name" : "mLock",
-     "field_offset" : 320,
+     "field_offset" : 352,
      "referenced_type" : "_ZTIN7android5MutexE"
     },
     {
      "access" : "private",
      "field_name" : "mHandleToObject",
-     "field_offset" : 352,
+     "field_offset" : 384,
      "referenced_type" : "_ZTIN7android6VectorINS_12ProcessState12handle_entryEEE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextCheckFunc",
-     "field_offset" : 512,
+     "field_offset" : 544,
      "referenced_type" : "_ZTIPFbRKN7android8String16ERKNS_2spINS_7IBinderEEEPvE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextUserData",
-     "field_offset" : 544,
+     "field_offset" : 576,
      "referenced_type" : "_ZTIPv"
     },
     {
      "access" : "private",
      "field_name" : "mRootDir",
-     "field_offset" : 576,
+     "field_offset" : 608,
      "referenced_type" : "_ZTIN7android7String8E"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolStarted",
-     "field_offset" : 608,
+     "field_offset" : 640,
      "referenced_type" : "_ZTIb"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolSeq",
-     "field_offset" : 640,
+     "field_offset" : 672,
      "referenced_type" : "_ZTIVi"
     },
     {
      "access" : "private",
      "field_name" : "mCallRestriction",
-     "field_offset" : 672,
+     "field_offset" : 704,
      "referenced_type" : "_ZTIN7android12ProcessState15CallRestrictionE"
     }
    ],
@@ -31725,12 +31780,12 @@
    "record_kind" : "class",
    "referenced_type" : "_ZTIN7android12ProcessStateE",
    "self_type" : "_ZTIN7android12ProcessStateE",
-   "size" : 96,
+   "size" : 100,
    "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
    "vtable_components" :
    [
     {
-     "component_value" : 88,
+     "component_value" : 92,
      "kind" : "vbase_offset"
     },
     {
@@ -31761,11 +31816,11 @@
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -92,
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -92,
      "kind" : "offset_to_top"
     },
     {
@@ -35300,6 +35355,25 @@
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
    "template_args" : [ "_ZTIN7android6ThreadE" ]
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "access" : "private",
+     "field_name" : "m_ptr",
+     "referenced_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE"
+    }
+   ],
+   "linker_set_key" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "record_kind" : "class",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
+   "template_args" : [ "_ZTIN7android6binder8internal25ClientCounterCallbackImplE" ]
+  },
   {
    "alignment" : 4,
    "fields" :
diff --git a/30/64/arm64_armv8-a/source-based/libbinder.so.lsdump b/30/64/arm64_armv8-a/source-based/libbinder.so.lsdump
index a54a5dc..7b496d5 100644
--- a/30/64/arm64_armv8-a/source-based/libbinder.so.lsdump
+++ b/30/64/arm64_armv8-a/source-based/libbinder.so.lsdump
@@ -1706,9 +1706,6 @@
   {
    "name" : "_ZN7android6binder6StatusC2EiiRKNS_7String8E"
   },
-  {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback11tryShutdownEv"
-  },
   {
    "name" : "_ZN7android6binder8internal21ClientCounterCallback12forcePersistEb"
   },
@@ -1716,7 +1713,22 @@
    "name" : "_ZN7android6binder8internal21ClientCounterCallback15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
   },
   {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback9onClientsERKNS_2spINS_7IBinderEEEb"
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC1Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC2Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl11tryShutdownEv"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl12forcePersistEb"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl9onClientsERKNS_2spINS_7IBinderEEEb"
   },
   {
    "name" : "_ZN7android6binderlsERNSt3__118basic_stringstreamIcNS1_11char_traitsIcEENS1_9allocatorIcEEEERKNS0_6StatusE"
@@ -3207,7 +3219,7 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEmRKT_"
+   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEmRKT_"
   },
   {
    "binding" : "weak",
@@ -3711,15 +3723,15 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEElEEbEERKT_DpOT0_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEElEEbEERKT_DpOT0_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
   },
   {
    "binding" : "weak",
@@ -4445,22 +4457,22 @@
    "name" : "_ZTCN7android2os17BpServiceCallbackE8_NS_9BpRefBaseE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_10IInterfaceE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_10IInterfaceE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os15IClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os15IClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os16BnClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os16BnClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE8_NS_7BBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE8_NS_7BBinderE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE8_NS_7IBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE8_NS_7IBinderE"
   },
   {
    "name" : "_ZTCN7android7BBinderE0_NS_7IBinderE"
@@ -4655,7 +4667,7 @@
    "name" : "_ZTTN7android2os17BpServiceCallbackE"
   },
   {
-   "name" : "_ZTTN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTTN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTTN7android7BBinderE"
@@ -4852,7 +4864,7 @@
    "name" : "_ZTVN7android6VectorIiEE"
   },
   {
-   "name" : "_ZTVN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTVN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTVN7android7BBinderE"
@@ -15061,7 +15073,7 @@
      "referenced_type" : "_ZTIPN7android8BpBinderE"
     },
     {
-     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
+     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
     },
     {
      "default_arg" : true,
@@ -21600,8 +21612,8 @@
    "alignment" : 8,
    "linker_set_key" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> &",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
-   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/RefBase.h"
   },
@@ -22451,6 +22463,15 @@
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> &",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 8,
    "linker_set_key" : "_ZTIRN7android2spINS_7BBinderEEE",
@@ -23210,6 +23231,15 @@
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 8,
    "linker_set_key" : "_ZTIPKN7android2spINS_7BBinderEEE",
@@ -23223,7 +23253,7 @@
    "alignment" : 8,
    "linker_set_key" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> *",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm64_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "self_type" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
@@ -24380,6 +24410,15 @@
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 8,
    "linker_set_key" : "_ZTIPN7android2spINS_7BBinderEEE",
@@ -24688,10 +24727,10 @@
   },
   {
    "alignment" : 8,
-   "linker_set_key" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
-   "name" : "android::binder::internal::ClientCounterCallback *",
-   "referenced_type" : "_ZTIN7android6binder8internal21ClientCounterCallbackE",
-   "self_type" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
+   "linker_set_key" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
+   "name" : "android::binder::internal::ClientCounterCallbackImpl *",
+   "referenced_type" : "_ZTIN7android6binder8internal25ClientCounterCallbackImplE",
+   "self_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
@@ -26337,6 +26376,16 @@
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -31621,62 +31670,68 @@
     },
     {
      "access" : "private",
-     "field_name" : "mMaxThreads",
+     "field_name" : "mWaitingForThreads",
      "field_offset" : 1024,
      "referenced_type" : "_ZTIm"
     },
     {
      "access" : "private",
-     "field_name" : "mStarvationStartTimeMs",
+     "field_name" : "mMaxThreads",
      "field_offset" : 1088,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "access" : "private",
+     "field_name" : "mStarvationStartTimeMs",
+     "field_offset" : 1152,
      "referenced_type" : "_ZTIl"
     },
     {
      "access" : "private",
      "field_name" : "mLock",
-     "field_offset" : 1152,
+     "field_offset" : 1216,
      "referenced_type" : "_ZTIN7android5MutexE"
     },
     {
      "access" : "private",
      "field_name" : "mHandleToObject",
-     "field_offset" : 1472,
+     "field_offset" : 1536,
      "referenced_type" : "_ZTIN7android6VectorINS_12ProcessState12handle_entryEEE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextCheckFunc",
-     "field_offset" : 1792,
+     "field_offset" : 1856,
      "referenced_type" : "_ZTIPFbRKN7android8String16ERKNS_2spINS_7IBinderEEEPvE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextUserData",
-     "field_offset" : 1856,
+     "field_offset" : 1920,
      "referenced_type" : "_ZTIPv"
     },
     {
      "access" : "private",
      "field_name" : "mRootDir",
-     "field_offset" : 1920,
+     "field_offset" : 1984,
      "referenced_type" : "_ZTIN7android7String8E"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolStarted",
-     "field_offset" : 1984,
+     "field_offset" : 2048,
      "referenced_type" : "_ZTIb"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolSeq",
-     "field_offset" : 2016,
+     "field_offset" : 2080,
      "referenced_type" : "_ZTIVi"
     },
     {
      "access" : "private",
      "field_name" : "mCallRestriction",
-     "field_offset" : 2048,
+     "field_offset" : 2112,
      "referenced_type" : "_ZTIN7android12ProcessState15CallRestrictionE"
     }
    ],
@@ -31685,12 +31740,12 @@
    "record_kind" : "class",
    "referenced_type" : "_ZTIN7android12ProcessStateE",
    "self_type" : "_ZTIN7android12ProcessStateE",
-   "size" : 280,
+   "size" : 288,
    "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
    "vtable_components" :
    [
     {
-     "component_value" : 264,
+     "component_value" : 272,
      "kind" : "vbase_offset"
     },
     {
@@ -31721,11 +31776,11 @@
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -264,
+     "component_value" : -272,
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -264,
+     "component_value" : -272,
      "kind" : "offset_to_top"
     },
     {
@@ -35260,6 +35315,25 @@
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
    "template_args" : [ "_ZTIN7android6ThreadE" ]
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "access" : "private",
+     "field_name" : "m_ptr",
+     "referenced_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE"
+    }
+   ],
+   "linker_set_key" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "record_kind" : "class",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
+   "template_args" : [ "_ZTIN7android6binder8internal25ClientCounterCallbackImplE" ]
+  },
   {
    "alignment" : 8,
    "fields" :
diff --git a/30/64/arm_armv7-a-neon/source-based/libbinder.so.lsdump b/30/64/arm_armv7-a-neon/source-based/libbinder.so.lsdump
index f5718b0..d643444 100644
--- a/30/64/arm_armv7-a-neon/source-based/libbinder.so.lsdump
+++ b/30/64/arm_armv7-a-neon/source-based/libbinder.so.lsdump
@@ -1714,9 +1714,6 @@
   {
    "name" : "_ZN7android6binder6StatusC2EiiRKNS_7String8E"
   },
-  {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback11tryShutdownEv"
-  },
   {
    "name" : "_ZN7android6binder8internal21ClientCounterCallback12forcePersistEb"
   },
@@ -1724,7 +1721,22 @@
    "name" : "_ZN7android6binder8internal21ClientCounterCallback15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
   },
   {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback9onClientsERKNS_2spINS_7IBinderEEEb"
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC1Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC2Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl11tryShutdownEv"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl12forcePersistEb"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl9onClientsERKNS_2spINS_7IBinderEEEb"
   },
   {
    "name" : "_ZN7android6binderlsERNSt3__118basic_stringstreamIcNS1_11char_traitsIcEENS1_9allocatorIcEEEERKNS0_6StatusE"
@@ -3215,7 +3227,7 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
+   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
   },
   {
    "binding" : "weak",
@@ -3759,15 +3771,15 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
   },
   {
    "binding" : "weak",
@@ -4501,22 +4513,22 @@
    "name" : "_ZTCN7android2os17BpServiceCallbackE4_NS_9BpRefBaseE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_10IInterfaceE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_10IInterfaceE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os15IClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os15IClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os16BnClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os16BnClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7BBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7BBinderE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7IBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7IBinderE"
   },
   {
    "name" : "_ZTCN7android7BBinderE0_NS_7IBinderE"
@@ -4711,7 +4723,7 @@
    "name" : "_ZTTN7android2os17BpServiceCallbackE"
   },
   {
-   "name" : "_ZTTN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTTN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTTN7android7BBinderE"
@@ -4908,7 +4920,7 @@
    "name" : "_ZTVN7android6VectorIiEE"
   },
   {
-   "name" : "_ZTVN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTVN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTVN7android7BBinderE"
@@ -15163,7 +15175,7 @@
      "referenced_type" : "_ZTIPN7android8BpBinderE"
     },
     {
-     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
+     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
     },
     {
      "default_arg" : true,
@@ -21702,8 +21714,8 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> &",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
-   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/RefBase.h"
   },
@@ -22544,6 +22556,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> &",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIRN7android2spINS_7BBinderEEE",
@@ -23303,6 +23324,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7BBinderEEE",
@@ -23316,7 +23346,7 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> *",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv7-a-neon_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "self_type" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
@@ -24473,6 +24503,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPN7android2spINS_7BBinderEEE",
@@ -24781,10 +24820,10 @@
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
-   "name" : "android::binder::internal::ClientCounterCallback *",
-   "referenced_type" : "_ZTIN7android6binder8internal21ClientCounterCallbackE",
-   "self_type" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
+   "linker_set_key" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
+   "name" : "android::binder::internal::ClientCounterCallbackImpl *",
+   "referenced_type" : "_ZTIN7android6binder8internal25ClientCounterCallbackImplE",
+   "self_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
@@ -26421,6 +26460,16 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "is_const" : true,
@@ -31695,62 +31744,68 @@
     },
     {
      "access" : "private",
-     "field_name" : "mMaxThreads",
+     "field_name" : "mWaitingForThreads",
      "field_offset" : 224,
      "referenced_type" : "_ZTIj"
     },
     {
      "access" : "private",
-     "field_name" : "mStarvationStartTimeMs",
+     "field_name" : "mMaxThreads",
      "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "access" : "private",
+     "field_name" : "mStarvationStartTimeMs",
+     "field_offset" : 320,
      "referenced_type" : "_ZTIx"
     },
     {
      "access" : "private",
      "field_name" : "mLock",
-     "field_offset" : 320,
+     "field_offset" : 384,
      "referenced_type" : "_ZTIN7android5MutexE"
     },
     {
      "access" : "private",
      "field_name" : "mHandleToObject",
-     "field_offset" : 352,
+     "field_offset" : 416,
      "referenced_type" : "_ZTIN7android6VectorINS_12ProcessState12handle_entryEEE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextCheckFunc",
-     "field_offset" : 512,
+     "field_offset" : 576,
      "referenced_type" : "_ZTIPFbRKN7android8String16ERKNS_2spINS_7IBinderEEEPvE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextUserData",
-     "field_offset" : 544,
+     "field_offset" : 608,
      "referenced_type" : "_ZTIPv"
     },
     {
      "access" : "private",
      "field_name" : "mRootDir",
-     "field_offset" : 576,
+     "field_offset" : 640,
      "referenced_type" : "_ZTIN7android7String8E"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolStarted",
-     "field_offset" : 608,
+     "field_offset" : 672,
      "referenced_type" : "_ZTIb"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolSeq",
-     "field_offset" : 640,
+     "field_offset" : 704,
      "referenced_type" : "_ZTIVi"
     },
     {
      "access" : "private",
      "field_name" : "mCallRestriction",
-     "field_offset" : 672,
+     "field_offset" : 736,
      "referenced_type" : "_ZTIN7android12ProcessState15CallRestrictionE"
     }
    ],
@@ -31759,12 +31814,12 @@
    "record_kind" : "class",
    "referenced_type" : "_ZTIN7android12ProcessStateE",
    "self_type" : "_ZTIN7android12ProcessStateE",
-   "size" : 96,
+   "size" : 104,
    "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
    "vtable_components" :
    [
     {
-     "component_value" : 88,
+     "component_value" : 96,
      "kind" : "vbase_offset"
     },
     {
@@ -31795,11 +31850,11 @@
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -96,
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -96,
      "kind" : "offset_to_top"
     },
     {
@@ -35334,6 +35389,25 @@
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
    "template_args" : [ "_ZTIN7android6ThreadE" ]
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "access" : "private",
+     "field_name" : "m_ptr",
+     "referenced_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE"
+    }
+   ],
+   "linker_set_key" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "record_kind" : "class",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
+   "template_args" : [ "_ZTIN7android6binder8internal25ClientCounterCallbackImplE" ]
+  },
   {
    "alignment" : 4,
    "fields" :
diff --git a/30/64/arm_armv8-a/source-based/libbinder.so.lsdump b/30/64/arm_armv8-a/source-based/libbinder.so.lsdump
index 7b25d8b..4593666 100644
--- a/30/64/arm_armv8-a/source-based/libbinder.so.lsdump
+++ b/30/64/arm_armv8-a/source-based/libbinder.so.lsdump
@@ -1714,9 +1714,6 @@
   {
    "name" : "_ZN7android6binder6StatusC2EiiRKNS_7String8E"
   },
-  {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback11tryShutdownEv"
-  },
   {
    "name" : "_ZN7android6binder8internal21ClientCounterCallback12forcePersistEb"
   },
@@ -1724,7 +1721,22 @@
    "name" : "_ZN7android6binder8internal21ClientCounterCallback15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
   },
   {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback9onClientsERKNS_2spINS_7IBinderEEEb"
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC1Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC2Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl11tryShutdownEv"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl12forcePersistEb"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl9onClientsERKNS_2spINS_7IBinderEEEb"
   },
   {
    "name" : "_ZN7android6binderlsERNSt3__118basic_stringstreamIcNS1_11char_traitsIcEENS1_9allocatorIcEEEERKNS0_6StatusE"
@@ -3215,7 +3227,7 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
+   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
   },
   {
    "binding" : "weak",
@@ -3759,15 +3771,15 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
   },
   {
    "binding" : "weak",
@@ -4501,22 +4513,22 @@
    "name" : "_ZTCN7android2os17BpServiceCallbackE4_NS_9BpRefBaseE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_10IInterfaceE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_10IInterfaceE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os15IClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os15IClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os16BnClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os16BnClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7BBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7BBinderE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7IBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7IBinderE"
   },
   {
    "name" : "_ZTCN7android7BBinderE0_NS_7IBinderE"
@@ -4711,7 +4723,7 @@
    "name" : "_ZTTN7android2os17BpServiceCallbackE"
   },
   {
-   "name" : "_ZTTN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTTN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTTN7android7BBinderE"
@@ -4908,7 +4920,7 @@
    "name" : "_ZTVN7android6VectorIiEE"
   },
   {
-   "name" : "_ZTVN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTVN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTVN7android7BBinderE"
@@ -15163,7 +15175,7 @@
      "referenced_type" : "_ZTIPN7android8BpBinderE"
     },
     {
-     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
+     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
     },
     {
      "default_arg" : true,
@@ -21702,8 +21714,8 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> &",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
-   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/RefBase.h"
   },
@@ -22544,6 +22556,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> &",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIRN7android2spINS_7BBinderEEE",
@@ -23303,6 +23324,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7BBinderEEE",
@@ -23316,7 +23346,7 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> *",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_arm_armv8-a_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "self_type" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
@@ -24473,6 +24503,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPN7android2spINS_7BBinderEEE",
@@ -24781,10 +24820,10 @@
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
-   "name" : "android::binder::internal::ClientCounterCallback *",
-   "referenced_type" : "_ZTIN7android6binder8internal21ClientCounterCallbackE",
-   "self_type" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
+   "linker_set_key" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
+   "name" : "android::binder::internal::ClientCounterCallbackImpl *",
+   "referenced_type" : "_ZTIN7android6binder8internal25ClientCounterCallbackImplE",
+   "self_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
@@ -26421,6 +26460,16 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "is_const" : true,
@@ -31695,62 +31744,68 @@
     },
     {
      "access" : "private",
-     "field_name" : "mMaxThreads",
+     "field_name" : "mWaitingForThreads",
      "field_offset" : 224,
      "referenced_type" : "_ZTIj"
     },
     {
      "access" : "private",
-     "field_name" : "mStarvationStartTimeMs",
+     "field_name" : "mMaxThreads",
      "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "access" : "private",
+     "field_name" : "mStarvationStartTimeMs",
+     "field_offset" : 320,
      "referenced_type" : "_ZTIx"
     },
     {
      "access" : "private",
      "field_name" : "mLock",
-     "field_offset" : 320,
+     "field_offset" : 384,
      "referenced_type" : "_ZTIN7android5MutexE"
     },
     {
      "access" : "private",
      "field_name" : "mHandleToObject",
-     "field_offset" : 352,
+     "field_offset" : 416,
      "referenced_type" : "_ZTIN7android6VectorINS_12ProcessState12handle_entryEEE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextCheckFunc",
-     "field_offset" : 512,
+     "field_offset" : 576,
      "referenced_type" : "_ZTIPFbRKN7android8String16ERKNS_2spINS_7IBinderEEEPvE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextUserData",
-     "field_offset" : 544,
+     "field_offset" : 608,
      "referenced_type" : "_ZTIPv"
     },
     {
      "access" : "private",
      "field_name" : "mRootDir",
-     "field_offset" : 576,
+     "field_offset" : 640,
      "referenced_type" : "_ZTIN7android7String8E"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolStarted",
-     "field_offset" : 608,
+     "field_offset" : 672,
      "referenced_type" : "_ZTIb"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolSeq",
-     "field_offset" : 640,
+     "field_offset" : 704,
      "referenced_type" : "_ZTIVi"
     },
     {
      "access" : "private",
      "field_name" : "mCallRestriction",
-     "field_offset" : 672,
+     "field_offset" : 736,
      "referenced_type" : "_ZTIN7android12ProcessState15CallRestrictionE"
     }
    ],
@@ -31759,12 +31814,12 @@
    "record_kind" : "class",
    "referenced_type" : "_ZTIN7android12ProcessStateE",
    "self_type" : "_ZTIN7android12ProcessStateE",
-   "size" : 96,
+   "size" : 104,
    "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
    "vtable_components" :
    [
     {
-     "component_value" : 88,
+     "component_value" : 96,
      "kind" : "vbase_offset"
     },
     {
@@ -31795,11 +31850,11 @@
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -96,
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -96,
      "kind" : "offset_to_top"
     },
     {
@@ -35334,6 +35389,25 @@
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
    "template_args" : [ "_ZTIN7android6ThreadE" ]
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "access" : "private",
+     "field_name" : "m_ptr",
+     "referenced_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE"
+    }
+   ],
+   "linker_set_key" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "record_kind" : "class",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
+   "template_args" : [ "_ZTIN7android6binder8internal25ClientCounterCallbackImplE" ]
+  },
   {
    "alignment" : 4,
    "fields" :
diff --git a/30/64/x86/source-based/libbinder.so.lsdump b/30/64/x86/source-based/libbinder.so.lsdump
index 8ad56df..0093050 100644
--- a/30/64/x86/source-based/libbinder.so.lsdump
+++ b/30/64/x86/source-based/libbinder.so.lsdump
@@ -1713,9 +1713,6 @@
   {
    "name" : "_ZN7android6binder6StatusC2EiiRKNS_7String8E"
   },
-  {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback11tryShutdownEv"
-  },
   {
    "name" : "_ZN7android6binder8internal21ClientCounterCallback12forcePersistEb"
   },
@@ -1723,7 +1720,22 @@
    "name" : "_ZN7android6binder8internal21ClientCounterCallback15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
   },
   {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback9onClientsERKNS_2spINS_7IBinderEEEb"
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC1Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC2Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl11tryShutdownEv"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl12forcePersistEb"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl9onClientsERKNS_2spINS_7IBinderEEEb"
   },
   {
    "name" : "_ZN7android6binderlsERNSt3__118basic_stringstreamIcNS1_11char_traitsIcEENS1_9allocatorIcEEEERKNS0_6StatusE"
@@ -3214,7 +3226,7 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
+   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
   },
   {
    "binding" : "weak",
@@ -3762,15 +3774,15 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
   },
   {
    "binding" : "weak",
@@ -4496,22 +4508,22 @@
    "name" : "_ZTCN7android2os17BpServiceCallbackE4_NS_9BpRefBaseE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_10IInterfaceE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_10IInterfaceE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os15IClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os15IClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os16BnClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os16BnClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7BBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7BBinderE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7IBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7IBinderE"
   },
   {
    "name" : "_ZTCN7android7BBinderE0_NS_7IBinderE"
@@ -4706,7 +4718,7 @@
    "name" : "_ZTTN7android2os17BpServiceCallbackE"
   },
   {
-   "name" : "_ZTTN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTTN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTTN7android7BBinderE"
@@ -4903,7 +4915,7 @@
    "name" : "_ZTVN7android6VectorIiEE"
   },
   {
-   "name" : "_ZTVN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTVN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTVN7android7BBinderE"
@@ -15158,7 +15170,7 @@
      "referenced_type" : "_ZTIPN7android8BpBinderE"
     },
     {
-     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
+     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
     },
     {
      "default_arg" : true,
@@ -21697,8 +21709,8 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> &",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
-   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/RefBase.h"
   },
@@ -22539,6 +22551,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> &",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIRN7android2spINS_7BBinderEEE",
@@ -23298,6 +23319,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7BBinderEEE",
@@ -23311,7 +23341,7 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> *",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "self_type" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
@@ -24468,6 +24498,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPN7android2spINS_7BBinderEEE",
@@ -24776,10 +24815,10 @@
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
-   "name" : "android::binder::internal::ClientCounterCallback *",
-   "referenced_type" : "_ZTIN7android6binder8internal21ClientCounterCallbackE",
-   "self_type" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
+   "linker_set_key" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
+   "name" : "android::binder::internal::ClientCounterCallbackImpl *",
+   "referenced_type" : "_ZTIN7android6binder8internal25ClientCounterCallbackImplE",
+   "self_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
@@ -26416,6 +26455,16 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "is_const" : true,
@@ -31690,62 +31739,68 @@
     },
     {
      "access" : "private",
-     "field_name" : "mMaxThreads",
+     "field_name" : "mWaitingForThreads",
      "field_offset" : 224,
      "referenced_type" : "_ZTIj"
     },
     {
      "access" : "private",
-     "field_name" : "mStarvationStartTimeMs",
+     "field_name" : "mMaxThreads",
      "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "access" : "private",
+     "field_name" : "mStarvationStartTimeMs",
+     "field_offset" : 288,
      "referenced_type" : "_ZTIx"
     },
     {
      "access" : "private",
      "field_name" : "mLock",
-     "field_offset" : 320,
+     "field_offset" : 352,
      "referenced_type" : "_ZTIN7android5MutexE"
     },
     {
      "access" : "private",
      "field_name" : "mHandleToObject",
-     "field_offset" : 352,
+     "field_offset" : 384,
      "referenced_type" : "_ZTIN7android6VectorINS_12ProcessState12handle_entryEEE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextCheckFunc",
-     "field_offset" : 512,
+     "field_offset" : 544,
      "referenced_type" : "_ZTIPFbRKN7android8String16ERKNS_2spINS_7IBinderEEEPvE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextUserData",
-     "field_offset" : 544,
+     "field_offset" : 576,
      "referenced_type" : "_ZTIPv"
     },
     {
      "access" : "private",
      "field_name" : "mRootDir",
-     "field_offset" : 576,
+     "field_offset" : 608,
      "referenced_type" : "_ZTIN7android7String8E"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolStarted",
-     "field_offset" : 608,
+     "field_offset" : 640,
      "referenced_type" : "_ZTIb"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolSeq",
-     "field_offset" : 640,
+     "field_offset" : 672,
      "referenced_type" : "_ZTIVi"
     },
     {
      "access" : "private",
      "field_name" : "mCallRestriction",
-     "field_offset" : 672,
+     "field_offset" : 704,
      "referenced_type" : "_ZTIN7android12ProcessState15CallRestrictionE"
     }
    ],
@@ -31754,12 +31809,12 @@
    "record_kind" : "class",
    "referenced_type" : "_ZTIN7android12ProcessStateE",
    "self_type" : "_ZTIN7android12ProcessStateE",
-   "size" : 96,
+   "size" : 100,
    "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
    "vtable_components" :
    [
     {
-     "component_value" : 88,
+     "component_value" : 92,
      "kind" : "vbase_offset"
     },
     {
@@ -31790,11 +31845,11 @@
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -92,
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -92,
      "kind" : "offset_to_top"
     },
     {
@@ -35329,6 +35384,25 @@
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
    "template_args" : [ "_ZTIN7android6ThreadE" ]
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "access" : "private",
+     "field_name" : "m_ptr",
+     "referenced_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE"
+    }
+   ],
+   "linker_set_key" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "record_kind" : "class",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
+   "template_args" : [ "_ZTIN7android6binder8internal25ClientCounterCallbackImplE" ]
+  },
   {
    "alignment" : 4,
    "fields" :
diff --git a/30/64/x86_64/source-based/libbinder.so.lsdump b/30/64/x86_64/source-based/libbinder.so.lsdump
index 2599f3c..4c747e3 100644
--- a/30/64/x86_64/source-based/libbinder.so.lsdump
+++ b/30/64/x86_64/source-based/libbinder.so.lsdump
@@ -1705,9 +1705,6 @@
   {
    "name" : "_ZN7android6binder6StatusC2EiiRKNS_7String8E"
   },
-  {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback11tryShutdownEv"
-  },
   {
    "name" : "_ZN7android6binder8internal21ClientCounterCallback12forcePersistEb"
   },
@@ -1715,7 +1712,22 @@
    "name" : "_ZN7android6binder8internal21ClientCounterCallback15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
   },
   {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback9onClientsERKNS_2spINS_7IBinderEEEb"
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC1Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC2Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl11tryShutdownEv"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl12forcePersistEb"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl9onClientsERKNS_2spINS_7IBinderEEEb"
   },
   {
    "name" : "_ZN7android6binderlsERNSt3__118basic_stringstreamIcNS1_11char_traitsIcEENS1_9allocatorIcEEEERKNS0_6StatusE"
@@ -3206,7 +3218,7 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEmRKT_"
+   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEmRKT_"
   },
   {
    "binding" : "weak",
@@ -3710,15 +3722,15 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEElEEbEERKT_DpOT0_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEElEEbEERKT_DpOT0_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
   },
   {
    "binding" : "weak",
@@ -4444,22 +4456,22 @@
    "name" : "_ZTCN7android2os17BpServiceCallbackE8_NS_9BpRefBaseE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_10IInterfaceE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_10IInterfaceE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os15IClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os15IClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os16BnClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os16BnClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE8_NS_7BBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE8_NS_7BBinderE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE8_NS_7IBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE8_NS_7IBinderE"
   },
   {
    "name" : "_ZTCN7android7BBinderE0_NS_7IBinderE"
@@ -4654,7 +4666,7 @@
    "name" : "_ZTTN7android2os17BpServiceCallbackE"
   },
   {
-   "name" : "_ZTTN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTTN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTTN7android7BBinderE"
@@ -4851,7 +4863,7 @@
    "name" : "_ZTVN7android6VectorIiEE"
   },
   {
-   "name" : "_ZTVN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTVN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTVN7android7BBinderE"
@@ -15060,7 +15072,7 @@
      "referenced_type" : "_ZTIPN7android8BpBinderE"
     },
     {
-     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
+     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
     },
     {
      "default_arg" : true,
@@ -21599,8 +21611,8 @@
    "alignment" : 8,
    "linker_set_key" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> &",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
-   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/RefBase.h"
   },
@@ -22450,6 +22462,15 @@
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> &",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 8,
    "linker_set_key" : "_ZTIRN7android2spINS_7BBinderEEE",
@@ -23209,6 +23230,15 @@
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 8,
    "linker_set_key" : "_ZTIPKN7android2spINS_7BBinderEEE",
@@ -23222,7 +23252,7 @@
    "alignment" : 8,
    "linker_set_key" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> *",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "self_type" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
@@ -24379,6 +24409,15 @@
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 8,
+   "linker_set_key" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 8,
    "linker_set_key" : "_ZTIPN7android2spINS_7BBinderEEE",
@@ -24687,10 +24726,10 @@
   },
   {
    "alignment" : 8,
-   "linker_set_key" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
-   "name" : "android::binder::internal::ClientCounterCallback *",
-   "referenced_type" : "_ZTIN7android6binder8internal21ClientCounterCallbackE",
-   "self_type" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
+   "linker_set_key" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
+   "name" : "android::binder::internal::ClientCounterCallbackImpl *",
+   "referenced_type" : "_ZTIN7android6binder8internal25ClientCounterCallbackImplE",
+   "self_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
@@ -26336,6 +26375,16 @@
    "size" : 8,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -31620,62 +31669,68 @@
     },
     {
      "access" : "private",
-     "field_name" : "mMaxThreads",
+     "field_name" : "mWaitingForThreads",
      "field_offset" : 1024,
      "referenced_type" : "_ZTIm"
     },
     {
      "access" : "private",
-     "field_name" : "mStarvationStartTimeMs",
+     "field_name" : "mMaxThreads",
      "field_offset" : 1088,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "access" : "private",
+     "field_name" : "mStarvationStartTimeMs",
+     "field_offset" : 1152,
      "referenced_type" : "_ZTIl"
     },
     {
      "access" : "private",
      "field_name" : "mLock",
-     "field_offset" : 1152,
+     "field_offset" : 1216,
      "referenced_type" : "_ZTIN7android5MutexE"
     },
     {
      "access" : "private",
      "field_name" : "mHandleToObject",
-     "field_offset" : 1472,
+     "field_offset" : 1536,
      "referenced_type" : "_ZTIN7android6VectorINS_12ProcessState12handle_entryEEE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextCheckFunc",
-     "field_offset" : 1792,
+     "field_offset" : 1856,
      "referenced_type" : "_ZTIPFbRKN7android8String16ERKNS_2spINS_7IBinderEEEPvE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextUserData",
-     "field_offset" : 1856,
+     "field_offset" : 1920,
      "referenced_type" : "_ZTIPv"
     },
     {
      "access" : "private",
      "field_name" : "mRootDir",
-     "field_offset" : 1920,
+     "field_offset" : 1984,
      "referenced_type" : "_ZTIN7android7String8E"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolStarted",
-     "field_offset" : 1984,
+     "field_offset" : 2048,
      "referenced_type" : "_ZTIb"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolSeq",
-     "field_offset" : 2016,
+     "field_offset" : 2080,
      "referenced_type" : "_ZTIVi"
     },
     {
      "access" : "private",
      "field_name" : "mCallRestriction",
-     "field_offset" : 2048,
+     "field_offset" : 2112,
      "referenced_type" : "_ZTIN7android12ProcessState15CallRestrictionE"
     }
    ],
@@ -31684,12 +31739,12 @@
    "record_kind" : "class",
    "referenced_type" : "_ZTIN7android12ProcessStateE",
    "self_type" : "_ZTIN7android12ProcessStateE",
-   "size" : 280,
+   "size" : 288,
    "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
    "vtable_components" :
    [
     {
-     "component_value" : 264,
+     "component_value" : 272,
      "kind" : "vbase_offset"
     },
     {
@@ -31720,11 +31775,11 @@
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -264,
+     "component_value" : -272,
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -264,
+     "component_value" : -272,
      "kind" : "offset_to_top"
     },
     {
@@ -35259,6 +35314,25 @@
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
    "template_args" : [ "_ZTIN7android6ThreadE" ]
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "access" : "private",
+     "field_name" : "m_ptr",
+     "referenced_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE"
+    }
+   ],
+   "linker_set_key" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "record_kind" : "class",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 8,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
+   "template_args" : [ "_ZTIN7android6binder8internal25ClientCounterCallbackImplE" ]
+  },
   {
    "alignment" : 8,
    "fields" :
diff --git a/30/64/x86_x86_64/source-based/libbinder.so.lsdump b/30/64/x86_x86_64/source-based/libbinder.so.lsdump
index b773f58..f86eb28 100644
--- a/30/64/x86_x86_64/source-based/libbinder.so.lsdump
+++ b/30/64/x86_x86_64/source-based/libbinder.so.lsdump
@@ -1713,9 +1713,6 @@
   {
    "name" : "_ZN7android6binder6StatusC2EiiRKNS_7String8E"
   },
-  {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback11tryShutdownEv"
-  },
   {
    "name" : "_ZN7android6binder8internal21ClientCounterCallback12forcePersistEb"
   },
@@ -1723,7 +1720,22 @@
    "name" : "_ZN7android6binder8internal21ClientCounterCallback15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
   },
   {
-   "name" : "_ZN7android6binder8internal21ClientCounterCallback9onClientsERKNS_2spINS_7IBinderEEEb"
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC1Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal21ClientCounterCallbackC2Ev"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl11tryShutdownEv"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl12forcePersistEb"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl15registerServiceERKNS_2spINS_7IBinderEEERKNSt3__112basic_stringIcNS8_11char_traitsIcEENS8_9allocatorIcEEEEbi"
+  },
+  {
+   "name" : "_ZN7android6binder8internal25ClientCounterCallbackImpl9onClientsERKNS_2spINS_7IBinderEEEb"
   },
   {
    "name" : "_ZN7android6binderlsERNSt3__118basic_stringstreamIcNS1_11char_traitsIcEENS1_9allocatorIcEEEERKNS0_6StatusE"
@@ -3214,7 +3226,7 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
+   "name" : "_ZNKSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE14__count_uniqueIS7_EEjRKT_"
   },
   {
    "binding" : "weak",
@@ -3762,15 +3774,15 @@
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE12__find_equalIS7_EERPNS_16__tree_node_baseIPvEERPNS_15__tree_end_nodeISO_EERKT_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE25__emplace_unique_key_argsIS7_JRKNS_21piecewise_construct_tENS_5tupleIJRKS7_EEENSO_IJEEEEEENS_4pairINS_15__tree_iteratorISD_PNS_11__tree_nodeISD_PvEEiEEbEERKT_DpOT0_"
   },
   {
    "binding" : "weak",
-   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal21ClientCounterCallback7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
+   "name" : "_ZNSt3__16__treeINS_12__value_typeINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android6binder8internal25ClientCounterCallbackImpl7ServiceEEENS_19__map_value_compareIS7_SD_NS_4lessIS7_EELb1EEENS5_ISD_EEE7destroyEPNS_11__tree_nodeISD_PvEE"
   },
   {
    "binding" : "weak",
@@ -4496,22 +4508,22 @@
    "name" : "_ZTCN7android2os17BpServiceCallbackE4_NS_9BpRefBaseE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_10IInterfaceE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_10IInterfaceE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_11BnInterfaceINS_2os15IClientCallbackEEE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os15IClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os15IClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE0_NS_2os16BnClientCallbackE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE0_NS_2os16BnClientCallbackE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7BBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7BBinderE"
   },
   {
-   "name" : "_ZTCN7android6binder8internal21ClientCounterCallbackE4_NS_7IBinderE"
+   "name" : "_ZTCN7android6binder8internal25ClientCounterCallbackImplE4_NS_7IBinderE"
   },
   {
    "name" : "_ZTCN7android7BBinderE0_NS_7IBinderE"
@@ -4706,7 +4718,7 @@
    "name" : "_ZTTN7android2os17BpServiceCallbackE"
   },
   {
-   "name" : "_ZTTN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTTN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTTN7android7BBinderE"
@@ -4903,7 +4915,7 @@
    "name" : "_ZTVN7android6VectorIiEE"
   },
   {
-   "name" : "_ZTVN7android6binder8internal21ClientCounterCallbackE"
+   "name" : "_ZTVN7android6binder8internal25ClientCounterCallbackImplE"
   },
   {
    "name" : "_ZTVN7android7BBinderE"
@@ -15158,7 +15170,7 @@
      "referenced_type" : "_ZTIPN7android8BpBinderE"
     },
     {
-     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
+     "referenced_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump"
     },
     {
      "default_arg" : true,
@@ -21697,8 +21709,8 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> &",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
-   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "self_type" : "_ZTIRKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/RefBase.h"
   },
@@ -22539,6 +22551,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> &",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIRN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIRN7android2spINS_7BBinderEEE",
@@ -23298,6 +23319,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7BBinderEEE",
@@ -23311,7 +23341,7 @@
    "alignment" : 4,
    "linker_set_key" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "name" : "const android::sp<android::IBinder::DeathRecipient> *",
-   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:out/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
+   "referenced_type" : "_ZTIKN7android2spINS_7IBinder14DeathRecipientEEE#ODR:/home/android-build/dot11/soong/.intermediates/frameworks/native/libs/binder/libbinder/android_vendor.30_x86_x86_64_shared/obj/frameworks/native/libs/binder/BpBinder.sdump",
    "self_type" : "_ZTIPKN7android2spINS_7IBinder14DeathRecipientEEE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
@@ -24468,6 +24498,15 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl> *",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIPN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "linker_set_key" : "_ZTIPN7android2spINS_7BBinderEEE",
@@ -24776,10 +24815,10 @@
   },
   {
    "alignment" : 4,
-   "linker_set_key" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
-   "name" : "android::binder::internal::ClientCounterCallback *",
-   "referenced_type" : "_ZTIN7android6binder8internal21ClientCounterCallbackE",
-   "self_type" : "_ZTIPN7android6binder8internal21ClientCounterCallbackE",
+   "linker_set_key" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
+   "name" : "android::binder::internal::ClientCounterCallbackImpl *",
+   "referenced_type" : "_ZTIN7android6binder8internal25ClientCounterCallbackImplE",
+   "self_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE",
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
@@ -26416,6 +26455,16 @@
    "size" : 4,
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
   },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "const android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIKN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h"
+  },
   {
    "alignment" : 4,
    "is_const" : true,
@@ -31690,62 +31739,68 @@
     },
     {
      "access" : "private",
-     "field_name" : "mMaxThreads",
+     "field_name" : "mWaitingForThreads",
      "field_offset" : 224,
      "referenced_type" : "_ZTIj"
     },
     {
      "access" : "private",
-     "field_name" : "mStarvationStartTimeMs",
+     "field_name" : "mMaxThreads",
      "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "access" : "private",
+     "field_name" : "mStarvationStartTimeMs",
+     "field_offset" : 288,
      "referenced_type" : "_ZTIx"
     },
     {
      "access" : "private",
      "field_name" : "mLock",
-     "field_offset" : 320,
+     "field_offset" : 352,
      "referenced_type" : "_ZTIN7android5MutexE"
     },
     {
      "access" : "private",
      "field_name" : "mHandleToObject",
-     "field_offset" : 352,
+     "field_offset" : 384,
      "referenced_type" : "_ZTIN7android6VectorINS_12ProcessState12handle_entryEEE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextCheckFunc",
-     "field_offset" : 512,
+     "field_offset" : 544,
      "referenced_type" : "_ZTIPFbRKN7android8String16ERKNS_2spINS_7IBinderEEEPvE"
     },
     {
      "access" : "private",
      "field_name" : "mBinderContextUserData",
-     "field_offset" : 544,
+     "field_offset" : 576,
      "referenced_type" : "_ZTIPv"
     },
     {
      "access" : "private",
      "field_name" : "mRootDir",
-     "field_offset" : 576,
+     "field_offset" : 608,
      "referenced_type" : "_ZTIN7android7String8E"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolStarted",
-     "field_offset" : 608,
+     "field_offset" : 640,
      "referenced_type" : "_ZTIb"
     },
     {
      "access" : "private",
      "field_name" : "mThreadPoolSeq",
-     "field_offset" : 640,
+     "field_offset" : 672,
      "referenced_type" : "_ZTIVi"
     },
     {
      "access" : "private",
      "field_name" : "mCallRestriction",
-     "field_offset" : 672,
+     "field_offset" : 704,
      "referenced_type" : "_ZTIN7android12ProcessState15CallRestrictionE"
     }
    ],
@@ -31754,12 +31809,12 @@
    "record_kind" : "class",
    "referenced_type" : "_ZTIN7android12ProcessStateE",
    "self_type" : "_ZTIN7android12ProcessStateE",
-   "size" : 96,
+   "size" : 100,
    "source_file" : "/frameworks/native/libs/binder/include/binder/ProcessState.h",
    "vtable_components" :
    [
     {
-     "component_value" : 88,
+     "component_value" : 92,
      "kind" : "vbase_offset"
     },
     {
@@ -31790,11 +31845,11 @@
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -92,
      "kind" : "vcall_offset"
     },
     {
-     "component_value" : -88,
+     "component_value" : -92,
      "kind" : "offset_to_top"
     },
     {
@@ -35329,6 +35384,25 @@
    "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
    "template_args" : [ "_ZTIN7android6ThreadE" ]
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "access" : "private",
+     "field_name" : "m_ptr",
+     "referenced_type" : "_ZTIPN7android6binder8internal25ClientCounterCallbackImplE"
+    }
+   ],
+   "linker_set_key" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "name" : "android::sp<android::binder::internal::ClientCounterCallbackImpl>",
+   "record_kind" : "class",
+   "referenced_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "self_type" : "_ZTIN7android2spINS_6binder8internal25ClientCounterCallbackImplEEE",
+   "size" : 4,
+   "source_file" : "/system/core/libutils/include/utils/StrongPointer.h",
+   "template_args" : [ "_ZTIN7android6binder8internal25ClientCounterCallbackImplE" ]
+  },
   {
    "alignment" : 4,
    "fields" :
-- 
2.31.1


From 32f8aa24f4a3d81f5f6f9a26cfd88f19882839a4 Mon Sep 17 00:00:00 2001
From: Albert I <kras@raphielgang.org>
Date: Fri, 9 Apr 2021 04:23:44 +0800
Subject: [PATCH 2/2] abi-dumps/vndk: Also add symlinks for armv8-2a on API 30

Fixes: 55a11ca ("vndk: add symlinks for armv8-2a")
Signed-off-by: Albert I <kras@raphielgang.org>
Change-Id: Ib6b136d40b9a936bb8ea418865d60db5089a34f7
---
 30/64/arm64_armv8-2a | 1 +
 30/64/arm_armv8-2a   | 1 +
 2 files changed, 2 insertions(+)
 create mode 120000 30/64/arm64_armv8-2a
 create mode 120000 30/64/arm_armv8-2a

diff --git a/30/64/arm64_armv8-2a b/30/64/arm64_armv8-2a
new file mode 120000
index 0000000..66b62d7
--- /dev/null
+++ b/30/64/arm64_armv8-2a
@@ -0,0 +1 @@
+arm64_armv8-a
\ No newline at end of file
diff --git a/30/64/arm_armv8-2a b/30/64/arm_armv8-2a
new file mode 120000
index 0000000..86f2ec5
--- /dev/null
+++ b/30/64/arm_armv8-2a
@@ -0,0 +1 @@
+arm_armv8-a
\ No newline at end of file
-- 
2.31.1

